using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ISIP223_Egurnova
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }


    //Вывод главного меню
    //
    //1. Выводит меню
    //2. Просит выбрать пункт меню
    //3. Возвращает значение - пункт, который выбрали


    //Вывод всех товаров
    //
    //1. Выводит все товары, что есть в базе


    //Меню входа в аккаунт
    //
    //1. Показывает меню с методами, которые можно выбрать


    //Регистрация
    //
    //1. Попросить пользователя заполнить экземпляр данными
    //2. Проверить не занят ли логин введённый пользователем и верен ли пароль, введённый повторно
    //3. Если все прошло успешно создаёт экземпляр класса пользователя из БД и заполняет его введёнными данными
    //4. Добавляет нового пользователя и возвращается в меню


    //Вход в уже зарегистрированного пользователя
    //
    //1. Проверяет логин и пароль 
    //2. Ищет по уже существующим пользовтелям совпадение
    //3. Если находит, то показывает пользовательское меню (личный кабинет)


    //Меню личного кабинета
    //
    //1. Даёт возможность просмотреть все товары, просмотреть корзину и историю заказов


    //Меню для взаимодействия с корзиной
    //Добавить товар в корзину
    //
    //1. Выбирает по айдишнику товар, записывает количество
    //2. Формирует объект класса Корзина товаров и заполняет введёнными данными


    //Корзина пользователя
    //
    //1. Если корзина пустая, то выводит сообщение об этом
    //2. Позволяет удалить товар из корзины, оформитьь заказ или вернуться в меню
    //


}
